using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace GenerateData
{
    public class NameGenerate
    {
        public static string[] MaleNamesArr = {"Агафон", "Адам", "Адольф", "Адриан", "Азарий", "Аким", "Алан",
            "Александр", "Алексей", "Альберт", "Альфред", "Анатолий", "Андрей", "Антон",
            "Аполлон", "Аристарх", "Аркадий", "Арнольд", "Арсений", "Артем", "Артур",
            "Архип", "Аскольд", "Афанасий", "Бенедикт", "Богдан", "Болеслав", "Борис",
            "Бронислав", "Вадим", "Валентин", "Валерий", "Вальтер", "Варлаам", "Василий",
            "Велор", "Велорий", "Венедикт", "Вениамин", "Виктор", "Вилен", "Вилли",
            "Виссарион", "Виталий", "Витольд", "Владимир", "Владислав", "Владлен", "Влас",
            "Вольдемар", "Всеволод", "Вячеслав", "Гавриил", "Гарри", "Гаянэ", "Геннадий",
            "Георгий", "Герасим", "Герман", "Глеб", "Гордей", "Гордей", "Григорий",
            "Гурий", "Давид", "Даниил", "Демьян", "Денис", "Дмитрий", "Дональд",
            "Донат", "Евгений", "Евдоким", "Егор", "Елисей", "Емельян", "Ермак",
            "Ефим", "Ефрем", "Захар", "Зиновий", "Иван", "Игнат", "Игорь",
            "Илларион", "Илья", "Иннокентий", "Иосиф", "Ипполит", "Ираклий", "Исаак",
            "Казимир", "Карл", "Касьян", "Ким", "Кирилл", "Клемент", "Клим",
            "Кондрат", "Константин", "Корней", "Лавр", "Лазарь", "Лев", "Леонард",
            "Леонид", "Леонтий", "Лука", "Любовь", "Любомир", "Людвиг", "Май",
            "Макар", "Максим", "Максимилиан", "Марк", "Мартин", "Матвей", "Мечеслав",
            "Мирон", "Мирослав", "Митрофан", "Михаил", "Модест", "Моисей", "Мстислав",
            "Назарий", "Натан", "Наум", "Нелли", "Никифор", "Николай", "Нинель",
            "Нисон", "Овидий", "Олег", "Орест", "Осип", "Оскар", "Остап",
            "Павел", "Панкрат", "Пантелей", "Парамон", "Петр", "Платон", "Прохор",
            "Роберт", "Родион", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан",
            "Савелий", "Самуил", "Святослав", "Севастьян", "Семен", "Сергей", "Соломон",
            "Станислав", "Степан", "Тарас", "Терентий", "Тимофей", "Тимур", "Тихон",
            "Трофим", "Устин", "Федор", "Феликс", "Филипп", "Фрол", "Харитон",
            "Эдуард", "Эльдар", "Эрик", "Эрнест", "Юлий", "Юрий", "Яков",
            "Ян", "Ярослав"};

        public static string[] MalePatronymicArr = {"Ааронович", "Абрамович", "Августович", "Авдеевич", "Аверьянович",
            "Адамович", "Адрианович", "Акимович", "Аксёнович", "Александрович",
            "Алексеевич", "Анатольевич", "Андреевич", "Анисимович", "Антипович",
            "Антонович", "Ануфриевич", "Арсенович", "Арсеньевич", "Артёмович",
            "Артемьевич", "Артурович", "Архипович", "Афанасьевич", "Бенедиктович",
            "Богданович", "Бориславич", "Бориславович", "Борисович", "Брониславович",
            "Вадимович", "Валентинович", "Валерианович", "Валерьевич", "Валерьянович",
            "Васильевич", "Венедиктович", "Вениаминович", "Викентьевич", "Викторович",
            "Виленович", "Вилорович", "Витальевич", "Владиленович", "Владимирович",
            "Владиславович", "Владленович", "Власович", "Всеволодович", "Вячеславович",
            "Гавриилович", "Гаврилович", "Геннадиевич", "Геннадьевич", "Георгиевич",
            "Герасимович", "Германович", "Гертрудович", "Глебович", "Гордеевич",
            "Григорьевич", "Гурьевич", "Давидович", "Давыдович", "Даниилович",
            "Данилович", "Демидович", "Демьянович", "Денисович", "Димитриевич",
            "Дмитриевич", "Дорофеевич", "Евгеньевич", "Евдокимович", "Евсеевич",
            "Евстигнеевич", "Егорович", "Елизарович", "Елисеевич", "Емельянович",
            "Еремеевич", "Ермилович", "Ермолаевич", "Ерофеевич", "Ефимович",
            "Ефимьевич", "Ефремович", "Ефстафьевич", "Жанович", "Жоресович",
            "Захарович", "Захарьевич", "Зиновьевич", "Иванович", "Игнатович",
            "Игнатьевич", "Игоревич", "Измаилович", "Изотович", "Иларионович",
            "Ильич", "Ильясович", "Иосипович", "Иосифович", "Исидорович",
            "Матвеевич", "Михайлович", "Петрович", "Семёнович", "Сергеевич",
            "Сидорович", "Тарасович", "Теймуразович", "Терентьевич", "Тимурович",
            "Тихонович", "Трифонович", "Трофимович", "Устинович", "Фёдорович",
            "Фадеевич", "Федосеевич", "Федосьевич", "Федотович", "Феликсович",
            "Феодосьевич", "Феоктистович", "Феофанович", "Филатович", "Филимонович",
            "Филиппович", "Фокич", "Фомич", "Фролович", "Харитонович",
            "Харламович", "Харлампович", "Харлампьевич", "Чеславович", "Эдгардович",
            "Эдгарович", "Эдуардович", "Юлианович", "Юльевич", "Юрьевич",
            "Яковлевич", "Якубович", "Ярославович" };

        public static string[] MaleSurnamesArr = {"Абрамов", "Авдеев", "Агафонов", "Аксенов", "Александров", "Алексеев",
            "Андреев", "Анисимов", "Антонов", "Артемьев", "Архипов", "Афанасьев",
            "Баранов", "Белов", "Белозеров", "Белоусов", "Беляев", "Беляков",
            "Беспалов", "Бирюков", "Блинов", "Блохин", "Бобров", "Бобылев",
            "Богданов", "Большаков", "Борисов", "Брагин", "Буров", "Быков",
            "Васильев", "Веселов", "Виноградов", "Вишняков", "Владимиров", "Власов",
            "Волков", "Воробьев", "Воронов", "Воронцов", "Гаврилов", "Галкин",
            "Герасимов", "Голубев", "Горбачев", "Горбунов", "Гордеев", "Горшков",
            "Григорьев", "Гришин", "Громов", "Гуляев", "Гурьев", "Гусев",
            "Гущин", "Давыдов", "Данилов", "Дементьев", "Денисов", "Дмитриев",
            "Доронин", "Дорофеев", "Дроздов", "Дьячков", "Евдокимов", "Евсеев",
            "Егоров", "Елисеев", "Емельянов", "Ермаков", "Ершов", "Ефимов",
            "Ефремов", "Жданов", "Жуков", "Журавлев", "Зайцев", "Захаров",
            "Зимин", "Зиновьев", "Зуев", "Зыков", "Иванов", "Игнатов",
            "Игнатьев", "Ильин", "Исаев", "Исаков", "Кабанов", "Казаков",
            "Калашников", "Калинин", "Капустин", "Карпов", "Кириллов", "Киселев",
            "Князев", "Ковалев", "Козлов", "Колесников", "Колобов", "Комаров",
            "Комиссаров", "Кондратьев", "Коновалов", "Кононов", "Константинов", "Копылов",
            "Корнилов", "Королев", "Костин", "Котов", "Кошелев", "Красильников",
            "Крылов", "Крюков", "Кудрявцев", "Кудряшов", "Кузнецов", "Кузьмин",
            "Кулагин", "Кулаков", "Куликов", "Лаврентьев", "Лазарев", "Лапин",
            "Ларионов", "Лебедев", "Лихачев", "Лобанов", "Логинов", "Лукин",
            "Лыткин", "Макаров", "Максимов", "Мамонтов", "Марков", "Мартынов",
            "Маслов", "Матвеев", "Медведев", "Мельников", "Меркушев", "Миронов",
            "Михайлов", "Михеев", "Мишин", "Моисеев", "Молчанов", "Морозов",
            "Муравьев", "Мухин", "Мясников", "Назаров", "Наумов", "Некрасов",
            "Нестеров", "Никитин", "Никифоров", "Николаев", "Никонов", "Новиков",
            "Носков", "Носов", "Овчинников", "Одинцов", "Орехов", "Орлов",
            "Осипов", "Павлов", "Панов", "Панфилов", "Пахомов", "Пестов",
            "Петров", "Петухов", "Поляков", "Пономарев", "Попов", "Потапов",
            "Прохоров", "Рогов", "Родионов", "Рожков", "Романов", "Русаков",
            "Рыбаков", "Рябов", "Савельев", "Савин", "Сазонов", "Самойлов",
            "Самсонов", "Сафонов", "Селезнев", "Селиверстов", "Семенов", "Сергеев",
            "Сидоров", "Силин", "Симонов", "Ситников", "Смирно", "Соболев",
            "Соколов", "Соловьев", "Сорокин", "Степанов", "Стрелков", "Субботин",
            "Суворов", "Суханов", "Сысоев", "Тарасов", "Терентьев", "Тетерин",
            "Тимофеев", "Титов", "Тихонов", "Третьяков", "Трофимов", "Туро",
            "Уваров", "Устинов", "Фадеев", "Федоров", "Федосеев", "Федотов",
            "Филатов", "Филиппов", "Фокин", "Фомин", "Фомичев", "Фролов",
            "Харитонов", "Хохлов", "Цветков", "Чернов", "Шарапов", "Шаров",
            "Шашков", "Шестаков", "Шилов", "Ширяев", "Шубин", "Щербаков",
            "Щукин", "Юдин", "Яковлев", "Якушев"};

        public static string[] FemaleNamesArr = {"Аврора", "Агата", "Агнесса", "Агния", "Ада",
            "Аза", "Алевтина", "Александра", "Алина", "Алиса",
            "Алла", "Альбина", "Альфреа", "Анастасия", "Ангелина",
            "Анжелика", "Анита", "Анна", "Антонина", "Анфиса",
            "Арина", "Астра", "Беата", "Белла", "Берта",
            "Бета", "Богдана", "Борислава", "Бронислава", "Валентина",
            "Валерия", "Ванда", "Варвара", "Василиса", "Венера",
            "Вера", "Вероника", "Веста", "Виктория", "Виолетта",
            "Виталина", "Галина", "Гелена", "Гелла", "Генриетта",
            "Гертруда", "Глафира", "Глория", "Дайна", "Данута",
            "Дарья", "Джульета", "Диана", "Дина", "Доля",
            "Доминика", "Ева", "Евгения", "Евдокия", "Екатерина",
            "Елена", "Елизавета", "Жанна", "Зинаида", "Зоя",
            "Иветта", "Изабелла", "Изольда", "Инара", "Инга",
            "Инесса", "Инна", "Ирина", "Ирма", "Ия",
            "Камилла", "Капитолина", "Карина", "Каролина", "Катарина",
            "Кира", "Клавдия", "Клара", "Кристина", "Ксения",
            "Лада", "Лайма", "Лариса", "Леся", "Лиана",
            "Лидия", "Лилия", "Лина", "Лола", "Людмила",
            "Майя", "Маргарита", "Марианна", "Марина", "Мария",
            "Марта", "Марфа", "Милена", "Мирдза", "Мирра",
            "Муза", "Надежда", "Наталия", "Неонила", "Никита",
            "Нина", "Нонна", "Нора", "Оксана", "Олеся",
            "Ольга", "Полина", "Прасковья", "Раиса", "Регина",
            "Рената", "Римма", "Роза", "Роксана", "Руслана",
            "Руфина", "Савва", "Сарра", "Светлана", "Серафима",
            "София", "Станислава", "Стелла", "Стефания", "Сусанна",
            "Таира", "Таисия", "Тамара", "Тамила", "Татьяна",
            "Ульяна", "Фаина", "Фекла", "Флора", "Фома",
            "Франсуаза", "Фрида", "Христина", "Эдита", "Элеонора",
            "Эллина", "Эльвира", "Эльза", "Эмма", "Эрика",
            "Юлия", "Юнона", "Ядвига", "Яна", "Ярослава"};

        public static string[] FemalePatronymicArr = { "Аароновна", "Абрамовна", "Августовна", "Авдеевна", "Аверьяновна",
            "Адамовна", "Адриановна", "Акимовна", "Аксёновна", "Александровна",
            "Алексеевна", "Анатольевна", "Андреевна", "Анисимовна", "Антиповна",
            "Антоновна", "Ануфриевна", "Арсеновна", "Арсеньевна", "Артёмовна",
            "Артемьевна", "Артуровна", "Архиповна", "Афанасьевна", "Бенедиктовна",
            "Богдановна", "Бориславна", "Бориславовна", "Борисовна", "Брониславовна",
            "Вадимовна", "Валентиновна", "Валериановна", "Валерьевна", "Валерьяновна",
            "Васильевна", "Венедиктовна", "Вениаминовна", "Викентьевна", "Викторовна",
            "Виленовна", "Вилоровна", "Витальевна", "Владиленовна", "Владимировна",
            "Владиславовна", "Владленовна", "Власовна", "Всеволодовна", "Вячеславовна",
            "Гаврииловна", "Гавриловна", "Геннадиевна", "Геннадьевна", "Георгиевна",
            "Герасимовна", "Германовна", "Гертрудовна", "Глебовна", "Гордеевна",
            "Григорьевна", "Гурьевна", "Давидовна", "Давыдовна", "Данииловна",
            "Даниловна", "Демидовна", "Демьяновна", "Денисовна", "Димитриевна",
            "Дмитриевна", "Дорофеевна", "Евгеньевна", "Евдокимовна", "Евсеевна",
            "Евстигнеевна", "Егоровна", "Елизаровна", "Елисеевна", "Емельяновна",
            "Еремеевна", "Ермиловна", "Ермолаевна", "Ерофеевна", "Ефимовна",
            "Ефимьевна", "Ефремовна", "Ефстафьевна", "Жановна", "Жоресовна",
            "Захаровна", "Захарьевна", "Зиновьевна", "Ивановна", "Игнатовна",
            "Игнатьевна", "Игоревна", "Измаиловна", "Изотовна", "Иларионовна",
            "Ильична", "Ильясовна", "Иосиповна", "Иосифовна", "Исидоровна",
            "Матвеевна", "Михайловна", "Петровна", "Семёновна", "Сергеевна",
            "Сидоровна", "Тарасовна", "Теймуразовна", "Терентьевна", "Тимуровна",
            "Тихоновна", "Трифоновна", "Трофимовна", "Устиновна", "Фёдоровна",
            "Фадеевна", "Федосеевна", "Федосьевна", "Федотовна", "Феликсовна",
            "Феодосьевна", "Феоктистовна", "Феофановна", "Филатовна", "Филимоновна",
            "Филипповна", "Фокична", "Фомична", "Фроловна", "Харитоновна",
            "Харламовна", "Харламповна", "Харлампьевна", "Чеславовна", "Эдгардовна",
            "Эдгаровна", "Эдуардовна", "Юлиановна", "Юльевна", "Юрьевна",
            "Яковлевна", "Якубовна", "Ярославовна" };

        public static string[] FemaleSurnamesArr = {"Абрамова", "Авдеева", "Агафонова", "Аксенова", "Александрова", "Алексеева",
            "Андреева", "Анисимова", "Антонова", "Артемьева", "Архипова", "Афанасьева",
            "Баранова", "Белова", "Белозерова", "Белоусова", "Беляева", "Белякова",
            "Беспалова", "Бирюкова", "Блинова", "Блохина", "Боброва", "Бобылева",
            "Богданова", "Большакова", "Борисова", "Брагина", "Бурова", "Быкова",
            "Васильева", "Веселова", "Виноградова", "Вишнякова", "Владимирова", "Власова",
            "Волкова", "Воробьева", "Воронова", "Воронцова", "Гаврилова", "Галкина",
            "Герасимова", "Голубева", "Горбачева", "Горбунова", "Гордеева", "Горшкова",
            "Григорьева", "Гришина", "Громова", "Гуляева", "Гурьева", "Гусева",
            "Гущина", "Давыдова", "Данилова", "Дементьева", "Денисова", "Дмитриева",
            "Доронина", "Дорофеева", "Дроздова", "Дьячкова", "Евдокимова", "Евсеева",
            "Егорова", "Елисеева", "Емельянова", "Ермакова", "Ершова", "Ефимова",
            "Ефремова", "Жданова", "Жукова", "Журавлева", "Зайцева", "Захарова",
            "Зимина", "Зиновьева", "Зуева", "Зыкова", "Иванова", "Игнатова",
            "Игнатьева", "Ильина", "Исаева", "Исакова", "Кабанова", "Казакова",
            "Калашникова", "Калинина", "Капустина", "Карпова", "Кириллова", "Киселева",
            "Князева", "Ковалева", "Козлова", "Колесникова", "Колобова", "Комарова",
            "Комиссарова", "Кондратьева", "Коновалова", "Кононова", "Константинова", "Копылова",
            "Корнилова", "Королева", "Костина", "Котова", "Кошелева", "Красильникова",
            "Крылова", "Крюкова", "Кудрявцева", "Кудряшова", "Кузнецова", "Кузьмина",
            "Кулагина", "Кулакова", "Куликова", "Лаврентьева", "Лазарева", "Лапина",
            "Ларионова", "Лебедева", "Лихачева", "Лобанова", "Логинова", "Лукина",
            "Лыткина", "Макарова", "Максимова", "Мамонтова", "Маркова", "Мартынова",
            "Маслова", "Матвеева", "Медведева", "Мельникова", "Меркушева", "Миронова",
            "Михайлова", "Михеева", "Мишина", "Моисеева", "Молчанова", "Морозова",
            "Муравьева", "Мухина", "Мясникова", "Назарова", "Наумова", "Некрасова",
            "Нестерова", "Никитина", "Никифорова", "Николаева", "Никонова", "Новикова",
            "Носкова", "Носова", "Овчинникова", "Одинцова", "Орехова", "Орлова",
            "Осипова", "Павлова", "Панова", "Панфилова", "Пахомова", "Пестова",
            "Петрова", "Петухова", "Полякова", "Пономарева", "Попова", "Потапова",
            "Прохорова", "Рогова", "Родионова", "Рожкова", "Романова", "Русакова",
            "Рыбакова", "Рябова", "Савельева", "Савина", "Сазонова", "Самойлова",
            "Самсонова", "Сафонова", "Селезнева", "Селиверстова", "Семенова", "Сергеева",
            "Сидорова", "Силина", "Симонова", "Ситникова", "Смирнова", "Соболева",
            "Соколова", "Соловьева", "Сорокина", "Степанова", "Стрелкова", "Субботина",
            "Суворова", "Суханова", "Сысоева", "Тарасова", "Терентьева", "Тетерина",
            "Тимофеева", "Титова", "Тихонова", "Третьякова", "Трофимова", "Турова",
            "Уварова", "Устинова", "Фадеева", "Федорова", "Федосеева", "Федотова",
            "Филатова", "Филиппова", "Фокина", "Фомина", "Фомичева", "Фролова",
            "Харитонова", "Хохлова", "Цветкова", "Чернова", "Шарапова", "Шарова",
            "Шашкова", "Шестакова", "Шилова", "Ширяева", "Шубина", "Щербакова",
            "Щукина", "Юдина", "Яковлева", "Якушева"};

        private static Random rand = new Random((int)DateTime.Now.Ticks);

        public static string GetMaleNameRandom()
        {
            return MaleNamesArr[rand.Next(MaleNamesArr.Count())];
        }

        public static string GetFemaleNameRandom()
        {
            return FemaleNamesArr[rand.Next(FemaleNamesArr.Count())];
        }

        public static string GetMalePatronymicRandom()
        {
            return MalePatronymicArr[rand.Next(MalePatronymicArr.Count())];
        }

        public static string GetFemalePatronymicRandom()
        {
            return FemalePatronymicArr[rand.Next(FemalePatronymicArr.Count())];
        }

        public static string GetMaleSurnameRandom()
        {
            return MaleSurnamesArr[rand.Next(MaleSurnamesArr.Count())];
        }

        public static string GetFemaleSurnameRandom()
        {
            return FemaleSurnamesArr[rand.Next(FemaleSurnamesArr.Count())];
        }
    }
}
